Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རིག་པར་བྱ་སྟེ། རྣམ་པར་སྤང་བར་བྱའོ།
en: Bodhisattva great beings should know these. “

source: །རབ་འབྱོར་གཞན་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་ལྡན་པ་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་མདོ་སྡེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱ་སྟེ། །རྣམ་པར་སྤང་བར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་།
en: Moreover, Subhūti, bodhisattva great beings should know that sūtras associated with the vehicle of the śrāvakas and associated with the pratyekabuddhas are also the work of Māra, and should then reject them. “

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་པར་འགྱུར་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་བ་དེ་དག་ཀྱང་། བདུད་སྡིག་ཏོ་ཅན་དག་དགེ་སློང་གི་ཆ་བྱད་དུ་བྱས་ཤིང་།
en: Moreover, Subhūti, the evil band of Māra will assume the forms of monks and also induce bodhisattva great beings toward the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of both external and internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, and the gateways of liberation—emptiness, signlessness, and wishlessness—by which they will attain the fruit of entering the stream to nirvāṇa, and attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཉེ་བར་བསྙེན་ཏེ། དེ་ཡང་དེ་ལ་དགའ་བ་སྐྱེད་ན། རབ་འབྱོར་དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱེད་པའི་རྒྱུ་རྐྱེན་མི་ལྡན་པ་སྟེ།
en: If they rejoice in them, then, Subhūti, the causes and conditions for committing this profound perfection of wisdom to writing, transmitting it, and disseminating it will not be present.

source: །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་ལུས་གསེར་ཀྱི་ཁ་དོག་དང་། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། འོད་འདོམ་གང་བར་ལྡན་པར་བྱས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་འོངས་ཏེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མོས་པ་སྐྱེད་དོ།
en: Moreover, Subhūti, the evil band of Māra will assume the forms of buddhas with bodies that have a golden complexion, the thirty-two major marks of a great person, and aureoles of light extending a full arm span, and then approach bodhisattva great beings.

source: །དེས་མོས་པ་བསྐྱེད་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཡོངས་སུ་ཉམ་པར་འགྱུར་ཏེ།
en: Bodhisattva great beings will develop devotion to those [illusions], and having developed devotion, they will lapse from [the pursuit of] all-aspect omniscience.

source: རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ་རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་མདུན་དུ་སངས་རྒྱས་ལ་སྩོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཉེ་བར་སྟོན་ཏོ།
en: Subhūti, bodhisattva great beings should know that this too is the work of Māra. {Ki.IV: 54} “Moreover, Subhūti, the evil band of Māra will exhibit in front of noble sons or noble daughters a community of monks headed by the Buddha.

source: །དེས་དེ་ལ་འདོད་པ་བསྐྱེད་ཅིང་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་དེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདི་ལྟ་བུར་ཤོག་ཤིག །
en: They will develop attachment to this [illusion], saying, ‘In the future may I too come to resemble this tathāgata, arhat, completely awakened buddha!

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་འདིས་ཚོགས་ཡོངས་སུ་བསྡུས་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་། ཚོགས་ཡོངས་སུ་བསྡུ་བར་བྱའོ།
en: I too should gather an assembly [of monks] like the assembly gathered by this tathāgata!

source: །དེ་བཞིན་གཤེགས་པ་འདིས་ཆོས་ཇི་ལྟར་སྟོན་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཆོས་བསྟན་པར་བགྱིའོ། །ཞེས་དེ་དེ་ལ་འདོད་པ་བསྐྱེད་པས།
en: I too should teach the Dharma in the manner in which this tathāgata teaches the Dharma!’

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཡོངས་སུ་ཉམ་པར་འགྱུར་ཏེ།
en: Consequently, they will lapse from [the pursuit of] all-aspect omniscience.

source: རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་ཕྲག་དུ་མ། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་དུ་མ།
en: Subhūti, bodhisattva great beings should know that this too is the work of Māra. “

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ལྟ་བུ་དག་ཉེ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the evil band of Māra will exhibit many hundreds of bodhisattvas, many thousands of bodhisattvas, many hundred thousands of bodhisattvas practicing the perfection of generosity, and practicing the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དེ་དག་ལ་འདོད་པ་བསྐྱེད་པར་འགྱུར་རོ། །དེས་དེ་དག་ལ་འདོད་པ་བསྐྱེད་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཡོངས་སུ་ཉམ་པར་འགྱུར་ཏེ། རབ་འབྱོར་དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་།
en: Those who follow the vehicle of the bodhisattvas will develop attachment to these [illusory bodhisattvas], and having developed attachment to them, they will lapse from [the pursuit of] all-aspect omniscience.

source: ཀློག་པ་དང་། ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། སྒོམ་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའི་རྒྱུ་རྐྱེན་མི་ལྡན་པ་སྟེ།
en: Subhūti, the causes and conditions for committing this profound perfection of wisdom to writing, transmitting it, disseminating it, cultivating it, and focussing their attention correctly on it will not be present.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་གཟུགས་མེད་དོ།
en: If you ask why, in this profound perfection of wisdom, there are no physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་དོ། །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་དོ།
en: There are no feelings, perceptions, formative predispositions, or consciousness. There are no sense fields, sensory elements, or links of dependent origination.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་མེད་དོ།
en: There are no perfections.

source: །སྟོང་པ་ཉིད་རྣམས་མེད་དོ།
en: There are no aspects of emptiness.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མེད་དོ།
en: There are no thirty-seven factors conducive to enlightenment.

source: །འཕགས་པའི་བདེན་པ་རྣམས་མེད་དོ།
en: There are no truths of the noble ones.

source: །བསམ་གཏན་རྣམས་མེད་དོ།
en: There are no meditative concentrations.

source: །ཚད་མེད་པ་རྣམས་མེད་དོ།
en: There are no immeasurable attitudes.

source: །གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་མེད་དོ།
en: There are no formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་མེད་དོ།
en: There are no eight aspects of liberation.

source: །མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་མེད་དོ།
en: There are no nine serial steps of meditative absorption.

source: །རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་མེད་དོ།
en: There are no gateways of liberation—emptiness, signlessness, and wishlessness.

source: །མངོན་པར་ཤེས་པ་རྣམས་མེད་དོ།
en: There are no extrasensory powers.

source: །ཏིང་ངེ་འཛིན་རྣམས་མེད་དོ།
en: There are no meditative stabilities.

source: །གཟུངས་ཀྱི་སྒོ་རྣམས་མེད་དོ།
en: There are no dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་མེད་དོ།
en: There are no ten powers of the tathāgatas.

source: །མི་འཇིགས་པ་བཞི་མེད་དོ།
en: There are no four fearlessnesses.

source: །སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་མེད་དོ།
en: There are no four kinds of exact knowledge.

source: །བྱམས་པ་ཆེན་པོ་མེད་དོ།
en: There is no great loving kindness.

source: །སྙིང་རྗེ་ཆེན་པོ་མེད་དོ།
en: There is no great compassion.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མེད་དོ།
en: There are no eighteen distinct qualities of the buddhas.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མེད་དོ།
en: There is no fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་མེད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མེད་དོ། །རབ་འབྱོར་གང་ལ་གཟུགས་མེད་པ་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པ་དང་། སྐྱེ་མཆེད་མེད་པ་དང་ཁམས་མེད་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པ་དང་།
en: There is no fruit of being destined for only one more rebirth, fruit of no longer being subject to rebirth, arhatship, or individual enlightenment.

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་མེད་པ་དང་། སྟོང་པ་ཉིད་རྣམས་མེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མེད་པ་དང་།
en: There is no unsurpassed, complete enlightenment. “

source: འཕགས་པའི་བདེན་པ་རྣམས་མེད་པ་དང་། བསམ་གཏན་རྣམས་མེད་པ་དང་། ཚད་མེད་པ་རྣམས་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་མེད་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་མེད་པ་དང་།
en: Subhūti, where there are no physical forms; no feelings, perceptions, formative predispositions, or consciousness; no sense fields, sensory elements, or links of dependent origination; no perfections; no aspects of emptiness; no thirty-seven factors conducive to enlightenment; no truths of the noble ones; no meditative concentrations; no immeasurable attitudes; no formless absorptions; no eight aspects of liberation; no nine serial steps of meditative absorption; no gateways of liberation—emptiness, signlessness, and wishlessness; no extrasensory powers; no meditative stabilities; {Ki.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་མེད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་མེད་པ་དང་ཏིང་ངེ་འཛིན་རྣམས་མེད་པ་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་མེད་པ་དང་། མི་འཇིགས་པ་རྣམས་མེད་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་མེད་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མེད་པ་དང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མེད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་མེད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མེད་པ་དེ་ལ་སངས་རྒྱས་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ། །རང་སངས་རྒྱས་མེད་དོ།
en: IV: 55} no dhāraṇī gateways; no powers of the tathāgatas; no fearlessnesses; no kinds of exact knowledge; [no great loving kindness]; no great compassion; no distinct qualities of the buddhas; no fruit of entering the stream to nirvāṇa; no fruit of being destined for only one more rebirth; no fruit of no longer being subject to rebirth; no arhatship or individual enlightenment; and no unsurpassed, complete enlightenment, then there are no buddhas, there are no bodhisattvas, there are no pratyekabuddhas, and there are no śrāvakas.

source: །ཉན་ཐོས་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: If you ask why, Subhūti, all phenomena are empty of inherent existence. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བར་ཆད་དུ་འགྱུར་བ་མང་བ་སྟེ།
en: Moreover, Subhūti, this perfection of wisdom will bring up many obstacles.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་ལ་ཡང་བར་ཆད་ཏུ་འགྱུར་བ་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Those noble sons or noble daughters who would commit this profound perfection of wisdom to writing, transmitting, teaching, and focusing their attention correctly on it, will also encounter obstacles.

source: འཛམ་བུའི་གླིང་འདིའི་རིན་པོ་ཆེ་གསེར་དང་ནོར་བུ་དང་མུ་ཏིག་དང་བཻཌཱུརྱ་དང་། དུང་དང་མན་ཤེལ་དང་བྱི་རུ་དང་དངུལ་དང་ས་ལེ་སྦྲམ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ནི་བར་ཆད་དུ་འགྱུར་བ་མང་ཞིང་། ཕྱིར་རྒོལ་བ་མང་བ་དག་གོ །རབ་འབྱོར་དེ་བཞིན་དུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ལུང་འབོག་པ་དང་།
en: Subhūti, just as all precious things that are highly valued in Jambudvīpa, including gold, gemstones, pearls, beryl, conch, crystal, coral, silver, and fine gold, will bring up many obstacles and much antagonism, in the same way, Subhūti, those noble sons or noble daughters who would commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, will also encounter many deeds of Māra.

source: ཁ་ཏོན་བྱེད་པ་དང་། སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་ལ་ཡང་བདུད་ཀྱི་ལས་མང་པོ་འབྱུང་བར་འགྱུར་རོ། །བར་ཆད་མང་པོ་འབྱུང་བར་འགྱུར་རོ། །ཕྱིར་རྒོལ་བ་མང་པོ་འབྱུང་བར་འགྱུར་རོ།
en: They will encounter many obstacles, and they will encounter much antagonism.” “

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་དེ་བཞིན་ནོ།
en: Blessed Lord, it is so!

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་དེ་བཞིན་ཏེ།
en: Sugata, it is so!” said Subhūti. “

source: འཛམ་བུའི་གླིང་འདིའི་རིན་པོ་ཆེ་གསེར་དང་ནོར་བུ་དང་མུ་ཏིག་དང་བཻ་ཌཱུརྱ་དང་དུང་དང་མན་ཤེལ་དང་བྱི་རུ་དང་དངུལ་དང་། ས་ལེ་སྦྲམ་གང་ཇི་སྙེད་ཅིག་མཆིས་པ་དེ་དག་ནི་བར་ཆད་དུ་འགྱུར་པ་མང་ཞིང་སླར་རྒོལ་བ་མང་བ་ལགས་སོ།
en: All the precious things of this Jambudvīpa that are highly valued, including gold, gemstones, pearls, beryl, conch, crystal, coral, silver, and fine gold, will bring up many obstacles and much antagonism.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ལུང་འབོག་པ་དང་། ཁ་ཏོན་བགྱིད་པ་དང་། སྟོན་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་ལ་ཡང་བདུད་ཀྱི་ལས་མང་པོ་འབྱུང་བར་འགྱུར་རོ།
en: In the same way, Blessed Lord, those noble sons or noble daughters who commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, will also encounter many deeds of Māra.

source: །བར་ཆད་མང་པོ་འབྱུང་བར་འགྱུར་རོ། །སླར་རྒོལ་བ་མང་པོ་འབྱུང་བར་འགྱུར་རོ།
en: They will encounter many obstacles, and they will encounter much antagonism.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་སྐྱེས་བུ་གླེན་པ་གང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་། ལུང་འབོག་པ་དང་ཁ་ཏོན་བགྱིད་པ་དང་སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དང་དག་གིས་བར་ཆད་བགྱིད་པ་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་སྟེ།
en: If one were to ask why, Blessed Lord, the foolish persons who would make obstacles for those noble sons and noble daughters who commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, are under the influence of Māra.

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་གླེན་པ་དེ་དག་ནི་བློ་ཆུང་ཞིང་བློ་ཞན་པར་འགྱུར་རོ།
en: Blessed Lord, those foolish persons are of feeble intelligence and weak intelligence.

source: །བཅོམ་ལྡན་འདས་སྐྱེས་བུ་གླེན་པ་གང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ལུང་འབོག་པ་དང་། ཁ་ཏོན་བགྱིད་པ་དང་སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་གི་བར་ཆད་བགྱིད་པ་དེ་དག་ནི། བློ་རྒྱ་ཤིན་དུ་ཆུང་བར་འགྱུར་ཏེ།
en: Blessed Lord, those foolish persons who would make obstacles for noble sons and noble daughters who commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, are extremely small-minded.

source: སངས་རྒྱས་ཀྱི་ཆོས་རླབས་པོ་ཆེ་དག་ལ་དེ་དག་གི་སེམས་མི་འཇུག་གོ།
en: Their minds do not engage with the magnificent attributes of the buddhas.

source: །དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་མི་འདྲི།
en: They themselves will not commit this profound perfection of wisdom to writing.

source: མི་ཀློག་ལུང་མི་འབོག །ཁ་ཏོན་མི་བགྱིད། མི་སྒོམ་ཚུལ་བཞིན་དུ་ཡིད་ལ་མི་བགྱིད་དེ།
en: They will not recite it, they will not transmit it, they will not disseminate it, they will not cultivate it, and they will not focus their attention correctly on it.

source: གཞན་འདྲི་ཞིང་ཀློག་པ་དང་ཁ་ཏོན་བགྱིད་པ་དང་། སྟོན་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དག་ལ་ཡང་བར་ཆད་བགྱིད་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: They will also make obstacles for others who would commit it to writing, reciting, transmitting, disseminating, teaching, and focus their attention correctly on it.” “

source: །དེ་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་མི་འདྲི། མི་ཀློག་ལུང་མི་འབོག །
en: It is so!”

source: ཁ་ཏོན་མི་བྱེད།
en: replied the Blessed One. “

source: མི་སྒོམ་ཚུལ་བཞིན་དུ་ཡིད་ལ་མི་བྱེད་ཅིང་། གཞན་འདྲི་བ་དང་ཀློག་པ་དང་། ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། སྟོན་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་གི་བར་ཆད་བྱེད་པ་དེ་དག་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ།
en: Those noble sons or noble daughters who do not commit this profound perfection of wisdom to writing, who do not recite it, do not transmit it, do not disseminate it, do not cultivate it, and do not focus their attention correctly on it, and who make obstacles for others who would commit it to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, are under the influence of Māra.

source: ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ།
en: They will have newly entered into the vehicle of the bodhisattvas.

source: དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ།
en: They will not have developed the roots of virtuous action.

source: དགེ་བའི་རྩ་བ་ཤིན་དུ་ཆུང་བ།
en: Their roots of virtuous action will be extremely feeble.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་དགེ་བའི་རྩ་བ་མ་བསྒྲུབས་པ།
en: They will not have attained the roots of virtuous action under the conquerors of the past.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་ཟིན་པ་དག་སྟེ།
en: They will not have been accepted by a spiritual mentor.

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་བློ་ཆུང་ཞིང་བློ་ཞན་པར་འགྱུར་རོ།
en: Those noble sons and noble daughters are of feeble intelligence and weak intelligence.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མི་འདྲི་མི་ཀློག །ལུང་མི་འབོག །ཁ་ཏོན་མི་བྱེད།
en: Those noble sons and noble daughters who do not commit this profound perfection of wisdom to writing, {Ki.

source: མི་སྒོམ། ཚུལ་བཞིན་དུ་ཡིད་ལ་མི་བྱེད་ཅིང་། གཞན་འདྲི་བ་དང་། ཀློག་པ་དང་ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་། སྟོན་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་གི་བར་ཆད་བྱེད་པ་དེ་དག་ནི་བློ་རྒྱ་ཤིན་དུ་ཆུང་བར་འགྱུར་ཏེ།
en: IV: 56} who do not recite it, do not transmit it, do not disseminate it, do not cultivate it, and do not focus their attention correctly on it, and who make obstacles for others who would commit it to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, are extremely small-minded.

source: སངས་རྒྱས་ཀྱི་ཆོས་རླབས་པོ་ཆེ་དག་ལ་དེ་དག་གི་སེམས་མི་འཇུག་གོ །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་། ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དག་ལ་བདུད་ཀྱི་ལས་འདི་དག་འབྱུང་མོད་ཀྱི། འོན་ཀྱང་རབ་འབྱོར་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། ལུང་འབོག་ཅིང་ཁ་ཏོན་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་། གོང་དུ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: Their minds do not engage with the magnificent attributes of the buddhas. “

source: ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་ན། རབ་འབྱོར་དེ་ནི་སངས་རྒྱས་ཀྱི་མཐུ་ཡིན་པར་ཤེས་པར་བྱ་སྟེ།
en: Subhūti, although those who commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it, will encounter these deeds of Māra, even so, Subhūti, if there are noble sons or noble daughters who do commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, and focusing their attention correctly on it, and if, in addition, they do perfect the perfection of meditative concentration; if they do perfect the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity; if they do perfect all the aspects of emptiness; if they do perfect the thirty-seven factors conducive to enlightenment; if they do perfect the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, [great loving kindness], great compassion, and the distinct qualities of the buddhas; and if they do perfect knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience, then, Subhūti, you should know that this is the power of the buddhas. “

source: དེས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲིའོ། །ཀློག་གོ །ལུང་འབོག་གོ །ཁ་ཏོན་བྱེད་དོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་དོ།
en: So it is that noble sons and noble daughters commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, and focusing their attention correctly on it.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །གོང་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: They perfect this profound perfection of wisdom, and in addition they perfect all [the other] perfections.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They perfect all the aspects of emptiness, and they perfect the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཀྱང་།
en: They perfect [the goals], up to and including all-aspect omniscience.
